added images to docs
